Revit 2027 API
LeaderArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual LeaderArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As LeaderArrayIterator
public:
virtual LeaderArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> LeaderArrayIterator
override ForwardIterator : unit -> LeaderArrayIterator
Return Value
LeaderArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
LeaderArray Class
Autodesk.Revit.DB Namespace